Documents/СоставПроизводственнойСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СоставПроизводственнойСмены</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УДАЛИТЬ_СоставПроизводственнойСмены</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеБригады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ВидПродукции</Name>
					<Comment>#14760</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКТУВПроизводственныхОперациях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособНачисленияВыработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цехи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент участия сотрудника при производстве потолка</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СотрудникиПоОперациям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Коэффициент1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПроизводственныеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник4</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыПродукции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПроизводства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПроизводства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СоставПроизводственнойСмены/Ext/ManagerModule.bsl
#Область ОбработчикиОбновления

//++ №14262
Процедура ЗаполнитьНовоеПолеОрганизация(Версия) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыпускПродукции.Организация КАК Ссылка
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	НЕ ВыпускПродукции.ПометкаУдаления
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивОрганизаций = новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивОрганизаций.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Если МассивОрганизаций.Количество() > 0 Тогда
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СоставПроизводственнойСмены.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СоставПроизводственнойСмены КАК СоставПроизводственнойСмены
		|ГДЕ
		|	НЕ СоставПроизводственнойСмены.ПометкаУдаления
		|";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ДокументОбъект.Организация = МассивОрганизаций[0];
			
			// Если организация одна, сразу записываем
			Если МассивОрганизаций.Количество() = 1 Тогда
				
				Попытка
					ДокументОбъект.Записать();
				Исключение
					Сообщить("Не удалось установить организацию: " + ДокументОбъект.Организация + " в документе: " + ДокументОбъект.Ссылка);
				КонецПопытки;
				
			Иначе
				
				// Создаём копии на каждую организацию (в транзакции) и фиксируем в основном документе
			    НачатьТранзакцию();
				
				КоличествоОрганизаций = МассивОрганизаций.Количество() - 1;
				
				Успешно = Истина;
				
				Для Сч = 1 По КоличествоОрганизаций Цикл
					
					НовыйДокументОбъект = ДокументОбъект.Скопировать();
					
					НовыйДокументОбъект.Организация = МассивОрганизаций[Сч];
					НовыйДокументОбъект.Дата = ДокументОбъект.Дата;
					
					НовыйДокументОбъект.Комментарий = СтрШаблон("#Создан автоматически при обновлении на версию %1, исходный документ №%2 от %3#", Версия, ДокументОбъект.Номер, ДокументОбъект.Дата);
					
					Попытка
						
						НовыйДокументОбъект.Записать(?(ДокументОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
						
					Исключение
						
						Успешно = Ложь;
						ОтменитьТранзакцию();
						
						Сообщить("Не удалось создать новый документ состав производственной смены по организации: " + НовыйДокументОбъект.Организация + " при копировании по документу: " + ДокументОбъект.Ссылка);
						Прервать;
						
					КонецПопытки;
					
				КонецЦикла;
				
				Попытка
					
					ДокументОбъект.Записать();
					
				Исключение
					
					Успешно = Ложь;
					ОтменитьТранзакцию();
					
					Сообщить("Не удалось установить организацию: " + ДокументОбъект.Организация + " в документе: " + ДокументОбъект.Ссылка);
					
				КонецПопытки;
				
				Если Успешно И ТранзакцияАктивна() Тогда
					ЗафиксироватьТранзакцию();
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
//-- №14262

#КонецОбласти
